In [1]:
people = {'first':['Chris', 'Lebron', 'Kobe'], 
          'last':['Paul', 'Bryant', 'Bryant'], 
          'email':['chrispaul.email.com', 'lebronbryant.email.com', 'kobebryant.email.com']}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)
df

    first    last                   email
0   Chris    Paul     chrispaul.email.com
1  Lebron  Bryant  lebronbryant.email.com
2    Kobe  Bryant    kobebryant.email.com

## <font color=red>第一部份: 增加或移除 column:</font>

### 我現在想<font color = yellow>增加</font>一個 column，內容是員工的全名。

In [4]:
# 想法很簡單，就是將 'first' 跟 'last' columns 合併(中間記得加空格)
df['full_name'] = df['first'] + ' ' +df['last']

#### 上面的例子是用 string 操作，如果是其他資料型態(例如 int)，那可以用 apply()

In [5]:
df

    first    last                   email      full_name
0   Chris    Paul     chrispaul.email.com     Chris Paul
1  Lebron  Bryant  lebronbryant.email.com  Lebron Bryant
2    Kobe  Bryant    kobebryant.email.com    Kobe Bryant

### 有了 full_name，我就不要 'first' 跟 'last' columns 了:

In [6]:
# 用 drop()
# 確認結果是我們要的，一樣用 inplace = True 對 df 做修改
df.drop(columns = ['first', 'last'], inplace = True)

In [7]:
df

                    email      full_name
0     chrispaul.email.com     Chris Paul
1  lebronbryant.email.com  Lebron Bryant
2    kobebryant.email.com    Kobe Bryant

### 現在我想將 full_name 拆回 last 跟 first 兩個 columns

In [8]:
df['full_name'].str.split(' ')
# 將 full name 這個 column 裡 string 的內容依照空格拆出來。

0       [Chris, Paul]
1    [Lebron, Bryant]
2      [Kobe, Bryant]
Name: full_name, dtype: object

In [9]:
# 可是我們是想將 13 的結果變成 data frame 的形式:
# 此時要用關鍵字: expand
df['full_name'].str.split(' ', expand = True)

        0       1
0   Chris    Paul
1  Lebron  Bryant
2    Kobe  Bryant

In [10]:
# 將 14 的結果跟 df merge 起來:
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)
# 增加一個 column，直接 df[新 col 名稱] = ....
# 增加兩個以上的 columns，用一個 list 包起來。

In [11]:
df

                    email      full_name   first    last
0     chrispaul.email.com     Chris Paul   Chris    Paul
1  lebronbryant.email.com  Lebron Bryant  Lebron  Bryant
2    kobebryant.email.com    Kobe Bryant    Kobe  Bryant

## <font color=red>第二部份: 增加或移除 row:</font>

### 我現在要增加一個人(一個 row)的資料

In [12]:
df = df.append({'first':'James'}, ignore_index = True)
# 將 ignore_index 設為 True，可以讓 pandas 自動忽略那些我們沒有給值的 columns。
# 且注意到 append() 並沒有 inplace = True 的機制。

In [13]:
df

                    email      full_name   first    last
0     chrispaul.email.com     Chris Paul   Chris    Paul
1  lebronbryant.email.com  Lebron Bryant  Lebron  Bryant
2    kobebryant.email.com    Kobe Bryant    Kobe  Bryant
3                     NaN            NaN   James     NaN

### 我現在要合併另一個 data frame 的 rows:

In [14]:
people2 = {'first':['James', 'Russel', 'Vince'], 
          'last':['Harden', 'Westbrook', 'Carter'], 
          'email':['jamesharden.email.com', 'russelwestbrook.email.com', 'vincecarter.email.com']}
df2 = pd.DataFrame(people2)

In [15]:
df2

    first       last                      email
0   James     Harden      jamesharden.email.com
1  Russel  Westbrook  russelwestbrook.email.com
2   Vince     Carter      vincecarter.email.com

In [16]:
df = df.append(df2, ignore_index = True)
# 會出現警告，但我們可以忽略它(他只是在說我們合併的資料 column 名稱不是一樣的順序)

C:\Users\User\Anaconda3\lib\site-packages\pandas\core\frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

In [17]:
df

                       email   first      full_name       last
0        chrispaul.email.com   Chris     Chris Paul       Paul
1     lebronbryant.email.com  Lebron  Lebron Bryant     Bryant
2       kobebryant.email.com    Kobe    Kobe Bryant     Bryant
3                        NaN   James            NaN        NaN
4      jamesharden.email.com   James            NaN     Harden
5  russelwestbrook.email.com  Russel            NaN  Westbrook
6      vincecarter.email.com   Vince            NaN     Carter

### 當然也可以用判斷條件來對 row 做調整:

In [21]:
filt = df['last'] == 'Bryant'
df.drop(index = df[filt].index, inplace = True)
df # 刪除 last 為 Bryant 的所有 rows
# 記得 column 代表 column, index 代表 row。

                       email   first   full_name       last
0        chrispaul.email.com   Chris  Chris Paul       Paul
3                        NaN   James         NaN        NaN
4      jamesharden.email.com   James         NaN     Harden
5  russelwestbrook.email.com  Russel         NaN  Westbrook
6      vincecarter.email.com   Vince         NaN     Carter